Revit 2027 API
ElementRecord.GetId Method
 Gets the id of the element record.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId GetId()
Public Function GetId As ElementId
public:
ElementId^ GetId()
member GetId : unit -> ElementId
Return Value
ElementId
 The element id.
See Also
Reference
ElementRecord Class
Autodesk.Revit.DB Namespace